#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["/dev/sdf"] must be replaced
-/+ resource "aws_ebs_volume" "this" {
      ~ arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:volume/vol-048e80a91df2b5135" -> (known after apply)
      ~ availability_zone    = "ap-southeast-1a" # forces replacement -> (known after apply) # forces replacement
      ~ id                   = "vol-048e80a91df2b5135" -> (known after apply)
      ~ iops                 = 3000 -> (known after apply)
      ~ kms_key_id           = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> (known after apply)
      - multi_attach_enabled = false -> null
      + snapshot_id          = (known after apply)
        tags                 = {
            "Name" = "ansible-testhost5/sdf"
        }
      ~ throughput           = 125 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Create_Auto_Alarms"] must be replaced
-/+ resource "aws_ec2_tag" "instance" {
      ~ id          = "i-0a6f3247805e75f3d,Create_Auto_Alarms" -> (known after apply)
      ~ resource_id = "i-0a6f3247805e75f3d" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Name"] must be replaced
-/+ resource "aws_ec2_tag" "instance" {
      ~ id          = "i-0a6f3247805e75f3d,Name" -> (known after apply)
      ~ resource_id = "i-0a6f3247805e75f3d" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["role"] must be replaced
-/+ resource "aws_ec2_tag" "instance" {
      ~ id          = "i-0a6f3247805e75f3d,role" -> (known after apply)
      ~ resource_id = "i-0a6f3247805e75f3d" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Name"] must be replaced
-/+ resource "aws_ec2_tag" "rbd" {
      ~ id          = "vol-08a7b1dc2f51dcece,Name" -> (known after apply)
      ~ resource_id = "vol-08a7b1dc2f51dcece" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_instance.this must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:129980683758:instance/i-0a6f3247805e75f3d" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0a6f3247805e75f3d" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-01116586fd6c0fe3e" -> (known after apply)
      ~ private_dns                          = "ip-172-18-76-29.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.18.76.29" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {
          - "Create_Auto_Alarms" = "true"
          - "Name"               = "ansible-testhost5"
          - "role"               = "catty eat cookies"
        } -> null
      ~ tags_all                             = {
          - "Create_Auto_Alarms" = "true"
          - "Name"               = "ansible-testhost5"
          - "role"               = "catty eat cookies"
        } -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (18 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
          - tags                  = {
              - "Name" = "ansible-testhost5/sdf"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-048e80a91df2b5135" -> null
          - volume_size           = 40 -> null
          - volume_type           = "gp3" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> true # forces replacement
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {
              - "Name" = "ansible-testhost5/root"
            } -> null
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-08a7b1dc2f51dcece" -> (known after apply)
          ~ volume_size           = 15 -> 10
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["/dev/sdf"] must be replaced
-/+ resource "aws_volume_attachment" "this" {
      ~ id          = "vai-370944455" -> (known after apply)
      ~ instance_id = "i-0a6f3247805e75f3d" # forces replacement -> (known after apply) # forces replacement
      ~ volume_id   = "vol-048e80a91df2b5135" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
